{"pageProps":{"postData":{"id":"js-performance","contentHtml":"<h1>Low-Hanging Fruits of JS build and test times</h1>\n<h3>Speeding up Jest test suite</h3>\n<p>The InsightAppSec frontend has about 4000 unit tests written in Jest. Depending on whether or not your laptop's plugged in, they take in or around 6 minutes to run. I recently spent an afternoon doing some benchmarking to try and make them run faster.</p>\n<p>Using Node 20 instead of Node 18 made the test suite run 35% faster (5m31s to 3m21s), which is a really nice improvement.</p>\n<p>Running tests selectively based on git changes (<code class=\"inline-code-custom-style\">jest --onlyChanged</code>) has no downsides for regular inner-loop software development (all the tests will still be run on the CI pipeline). But this small change brought the average run time down to about a minute, depending on how many files I've changed.</p>\n<h3>Speeding up webpack local dev server</h3>\n<p>Configuring webpack to use caching when running a local dev server took <code class=\"inline-code-custom-style\">npm run dev</code> from taking 1 minute 40 seconds to run, to taking 12 seconds to run. It works by effectively making <code class=\"inline-code-custom-style\">npm run dev</code> use HMR from cold.</p>\n<h3>Leverage existing boring tools</h3>\n<p>I couldn't believe how much faster these really simple changes made the build and test times. Moving the test suite from Jest to Vitest would probably have taken me a month, and the same goes for swapping webpack with RSpack or Vite (we use a good few plugins).</p>\n<p>In the future I'm going to be a bit more wary about big build/test tool migrations for performance reasons because there's still a lot of low-hanging fruit with these slightly older tools. It is well worth doing a bit of profiling before doing a costly tooling migration.</p>\n<p>In the meantime I'm enjoying the speedups. I get an hour or so back every week and running tests doesn't take me out of that nice flow state quite like it used to.</p>","title":"Low-Hanging Fruits of JS build and test times","short":"Simple ways to speed up Jest tests and webpack builds","date":"2025-02-19","slug":"js-build-times","createdAt":"2025-02-19","img":"blog-2.jpg","tags":["Note"]}},"__N_SSG":true}