{"pageProps":{"postData":{"id":"starting-serverless","contentHtml":"<h1>Starting with AWS and the Serverless Framework</h1>\n<img src=\"/images/sls/fourTheorem.png\" alt=\"fourtheorem\">\n<p>Since joining fourTheorem earlier this year I've worked with AWS and the Serverless framework a lot, here are some of the best learning resources I've found:</p>\n<h2>Serverless Stack</h2>\n<p>Serverless Stack's <a href=\"https://serverless-stack.com/chapters/setup-the-serverless-framework.html\">guide to the Serverless Framework</a> is a comprehensive and well laid out resource on setting up a serverless project.</p>\n<p>The guide details how to set up a fullstack note-taking webapp using Lambda, DynamoDB, Cognito, Amplify, and S3. The project uses React, but the important bits are explained clearly enough to be followed along with any frontend framework. The guide even sets up a billing system with the Stripe API, making it a great way to prototype a potential business project very quickly.</p>\n<p>Serverless Stack also provides fantastic standalone pages that explain some of the more confusing ideas in serverless applications, like <a href=\"https://serverless-stack.com/chapters/what-is-iam.html\">IAM Roles</a>, <a href=\"https://serverless-stack.com/chapters/cognito-user-pool-vs-identity-pool.html\">Cognito user and identity pools</a>, and <a href=\"https://serverless-stack.com/chapters/stages-in-serverless-framework.html\">stages</a>.</p>\n<h2>Complete Coding</h2>\n<p>There's not much to say here except that <a href=\"https://www.youtube.com/channel/UC8uBP0Un18DJAnWjm1CPqBg\">Complete Coding</a> has the best Serverless AWS tutorials on the internet.</p>\n<p>The videos are concise, use best practices, and usually come with a git repo in the description which is very helpful. Complete coding is always the first place I go to when I need to refresh my understanding of anything AWS or Serverless.</p>\n<h2>SLIC Starter</h2>\n<p><a href=\"https://github.com/fourtheorem/slic-starter\">SLIC Starter</a> is a checklist application that can be used to bootstrap any serverless project.</p>\n<p>While Serverless Stack's guide sets up some services such as cognito through the AWS console, SLIC is configured entirely by code. By using this \"Infrastructure-as-Code\" approach, the project can easily be version controlled, deleted, or deployed on another AWS account.</p>\n<p>I find that SLIC is a great resource for seeing how certain best practices should be done in a serverless way:</p>\n<ol class=\"pl-5\">\n  <li>Define resources as code (not in the console)</li>\n  <li>Separate resources and functions</li>\n  <li>Build systems from <a href=\"https://www.fourtheorem.com/blog/monorepo\">smaller loosely coupled services</a></li>\n  <li>Fully automate the CICD pipeline</li>\n</ol>\n<p>SLIC starter was created by the team at fourTheorem and it's open source so contributions are welcome by everyone! 😊</p>","title":"Starting with AWS and the Serverless Framework","short":"The best learning resources for getting started with serverless.","createdAt":"2021-09-21","date":"2021-09-21","slug":"starting-serverless","tags":["Work","Code"]}},"__N_SSG":true}