{"pageProps":{"postData":{"id":"time-tamer","contentHtml":"<h1>🦁 Time Tamer</h1>\n<p>I made a time management app for MacOs called Time Tamer. It's essentially a very simple minimal version of <a href=\"https://toggl.com/\">Toggl</a>. You can download it <a href=\"https://github.com/PaulTreanor/time-tamer/releases/tag/v1.0\">here as a GitHub release</a>.</p>\n<img src=\"/images/tt/time-tamer-demo.png\" alt=\"Time Tamer\">\n<p>It's not groundbreaking, but it's good enough for me to use it everyday. I'm not finished with it either, there's still a few little fixes I'd like to address...</p>\n<ul>\n<li>Display the app's timer status in the menu bar</li>\n<li>Pressing <code>Enter</code> key while typing adds task to list</li>\n<li>Delete button to deleted existing tasks</li>\n<li>Edit button to edit existing tasks</li>\n<li>Releases for windows and linux</li>\n</ul>\n<h3>Why I made it</h3>\n<p>I've found that <span class=\"font-bold\"> I work better if I time myself while I work</span>. It makes focusing hard feel like a game, while also holding me accountable, so I feel bad if I piss about too much.</p>\n<p>Until recently I just played these <a href=\"https://www.youtube.com/watch?v=lTRiuFIWV54\">1 hour YouTube LoFi compilations</a> while I worked and counted the number of videos up to track how long I work. Time Tamer is my attempt at making a slightly more elegant tool for the job.</p>\n<h3>Suggestion on how to use Time Tamer</h3>\n<p>I like these <span class=\"italic\">meta<span> work tools, but they only work if you take them seriously. If you start cheating then the timer loses all it's motivational powers.</span></span></p>\n<ul>\n<li>\n<p><span class=\"font-bold\">I only track things <em>while</em> I'm actually working on them</span>. If I leave my desk or open Twitter, I pause the timer.</p>\n</li>\n<li>\n<p>I also <span class=\"font-bold\">only track real work</span> (stuff I'm getting paid to do). This way I can be sure that the <em>total time</em> at the end of each day is a source of truth.</p>\n</li>\n<li>\n<p>I set goals every morning for how many hours of focused work I'll try to get done.</p>\n</li>\n</ul>","title":"🦁 Time Tamer","short":"A simple time management app for MacOs","date":"2023-03-03","slug":"time-tamer","createdAt":"2023-03-03","tags":["Release"]}},"__N_SSG":true}