{"pageProps":{"postData":{"id":"next-step","contentHtml":"<h1>The next step in my career</h1>\n<p>On Thursday I'm going to be starting a new chapter in my career. I'm leaving my current employer fourTheorem to spend the rest of 2023 working on some creative passion projects and learning as much as I can.</p>\n<p>I can't thank fourTheorem enough for the opportunities they've given me. The team, the work environment, and the projects that I've gotten the chance to work on have been amazing. If you like serverless computing, then fourTheorem is an outstanding place to work.</p>\n<h3>A body of work</h3>\n<p>Despite my best intentions, I've struggled to focus on side projects while working full time, so I'm setting aside the rest of the year to work on them. My plan is to spend the next 9ish months building cool things and then look for another job next Spring.</p>\n<p>My main goal is to create a body of work by treating the rest of 2023 as a sort of mini-degree in shipping software. In terms of tech stack, I'm going to double down on what I know best: AWS, serverless, Node, and React. These tools aren't going anywhere and I like working with them.</p>\n<p>I'll try my best to build in public and share what I learn, and I'll be active on my blog (<a href=\"https://paultreanor.com/rss.xml\">here's my RSS</a>) and also on <a href=\"https://twitter.com/paultreanordev\">Twitter</a> if you want to keep up to date with what I'm working on.</p>\n<h3>Website development</h3>\n<p>In addition to building my own products, I'm going to be helping local businesses develop an online presence.</p>\n<p>I've done my market research, and I'm working on some case studies…but the only way to validate a business like this is to get stuck in.</p>\n<p>Even if I can't make a full income from this work, it should keep me grounded in some real world business needs, and I'm looking forward to being able to point at more things and say that I helped make them happen.</p>\n<h3>Finances</h3>\n<p>Now for the financial tea…</p>\n<p>My savings are nothing special, but my expenses are low. I have about €15,000 saved, I have no debt, and my monthly spend can pretty reasonably be kept to under €1,500 (I have low rent).</p>\n<p>I have no grand ideas of retiring at 30 and I'm happy to get another job next year, so there isn't any financial drama or magic here.</p>\n<h3>Conclusion</h3>\n<p>I'm really looking forward to working on my own things full time for a while, I can't wait to show off what I'm making.</p>","title":"The next step in my career","short":"Dedicating a year to work on cool stuff","date":"2023-06-13","slug":"new-step","createdAt":"2023-06-13","img":"blog-2.jpg","tags":["Work"]}},"__N_SSG":true}