{"pageProps":{"postData":{"id":"job-hunting-2024","contentHtml":"<h1>Job hunting 2024</h1>\n<p>Job hunting is soul crushing, but I managed to navigate the rough market in early 2024 while getting a steady-ish stream of interviews and an offer I'm  really happy with. Here's what worked for me.</p>\n<h2>Get on linkedIn</h2>\n<p>Yes it's awful, but I'm glad I got over myself and made an account. LinkedIn has built in social proof via your connections, which makes it more valuable than just cold applying to jobs with a CV.</p>\n<p>LinkedIn puts you in touch with recruiters. When you apply for a job you should message the recruiter who posted the job, they almost always respond (use the Premium free trial to message them).</p>\n<p>Keep your bio short and make your profile readable for recruiters. Include a nice profile picture and set your profile to \"open to work\". Within a week or 2 you should start getting messages and calls from recruiters.</p>\n<p>Using LinkedIn to get recruiters to reach out is a nicer experience than doomscrolling Indeed. My entire job search was conducted through LinkedIn. I directly applied to a handful of relevant jobs per week via the LinkedIn job board.</p>\n<h2>Focus on a specific tech stack</h2>\n<p>I only applied to jobs that were in my chosen tech stack - AWS, Node, and React. There was a steady stream of 4-5 new viable roles for me on LinkedIn each week and I applied for those roles only. Applying to hundreds of jobs just means wasting time on roles you were never going to get.</p>\n<p>Instead I maximised my chances with jobs I was actually suited for. I edited my CV for each role (spend like 2 minutes max on this) and wrote up a to-the-point cover letter about why I was interested in the role and why I was a really good fit. After I applied, I'd message the recruiter/hiring manager directly on LinkedIn to say that I applied and that I wanted to maximise my chances because the job seemed like such a perfect match.</p>\n<p>Focusing on quality of applications over quantity helped me keep up my morale. It made interviewing easier too. I didn't have to cram things I didn't know about, but I learned everything I possibly could about JavaScript, React, and Serverless AWS.</p>\n<h2>Have cool side projects</h2>\n<p>Give <a href=\"https://gist.github.com/adamwiggins/5687294\">My Heroku Values</a> a read. Going into this job hunt I had around 4-5 public side projects that I shipped in the last 12 months. <strong>Every single technical interviewer mentioned that they liked this about me.</strong> If I have one piece of advice, it's to build something and ship it.</p>\n<p>If you don't have a side project then I recommend trying to optimise some sort of workflow you have using code. Give your solution a name, a webpage, and a public GitHub repo. A good place to start is extensible software, for example you could consider making your VSCode extension. Keep it small (&#x3C;4hrs of work) and just focus on actually shipping something. Focus on this and nothing else for 1 week and it will pay off. If you can make a habit of this it is deeply rewarding.</p>\n<p>After you build your thing, try to be public about it, put it on the internet and share on social media.</p>\n<h2>Use referrals</h2>\n<p>I got referred to my current job and my previous job. Err on the side of being a little bit cheeky when asking for referrals, <a href=\"http://harpreetsingh.github.io/books/kleon-austin-show-your-work/index#dont-network-do-compelling-work-and-be-findable\">don't network, use your network.</a></p>\n<p>The nice thing about referrals is that when your application goes into the void, you can ask the person to who referred you to follow up with HR after a week or 2. This is a perfectly fine thing to ask, just make sure you pay the favour back when you can.</p>\n<h2>Additional thoughts and observations</h2>\n<ol>\n    <li>For the first 3 weeks of my job search I got few responses and outreach from recruiters. It took a while for the search to warm up.</li>\n    <li>Move quickly. Apply to new jobs right away. Reply to recruiters immediately. Ring people back ASAP. Schedule interviews for the earliest possible slot. This compresses your job hunt and gives you more opportunities.</li>\n    <li>Don't stress out about whether or not a job is a good fit before you get an offer. It's just wasted anxiety.</li>\n    <li><s>ATS systems can't read fancy Figma CVs. When I redid mine in Google Docs PDF, I saw a notable uptick in responses. </s><b> Update:</b> <a>Apparently ATS systems are BS</a> so this could just have been a coincidence.</li>\n    <li>Almost all tech jobs in Ireland are in Dublin or Belfast and require you to be in the office at least 3 days a week.</li>\n    <li>Make peace with Workday...yes it's vile software, but suck it up and keep re-entering your CV for each role. It's a small annoyance in the grand scheme of things.</li>\n    <li>There is far more fullstack roles than frontend or backend.</li>\n    <li>Make a reminder in your calendar to cancel your LinkedIn Premium Free trial after 1 month or you will be out €40. I'm still sour about this...</li>\n    <li>January to May is ideal for job hunting due to new budgets and initiatives driving hiring. From mid-June to September things slowdown as staff take annual leave, and in November to December hiring basically stops for the holidays. If you start looking in early January you can have a 5 month run before hiring slows down for summer.</li>\n</ol>\n<p>I'm not an expert but I hope this helps someone. In the interest of being as transparent as possible here's the CV that got me the offer I accepted:</p>\n<img src=\"/images/job-hunting/cv-image.jpg\" alt=\"My CV\">","title":"Job hunting 2024","short":"Documenting my job hunting experience in Q1 2024","date":"2024-03-15","slug":"job-hunting-2024","createdAt":"2024-03-15","img":"blog-2.jpg","tags":["Essay"]}},"__N_SSG":true}