{"pageProps":{"postData":{"id":"deep-research","contentHtml":"<h1>Studying is 100 times easier than it used to be</h1>\n<p>Google Gemini's standard Deep Research tool is available for free to everyone with a Google account. It's an AI research tool that can generate reports on basically anything, from very specific historical events, to sports psychology papers that address a specific question you have, to very technical programming questions. It crawls hundreds of websites and the quality of the final report is astounding.</p>\n<p>So studying technical stuff just got 100 times easier! You can be really specific about what you want to learn and what you struggle with. You can ask it to give 10 complex examples. You can ask it to be funny if you need to learn something boring. I don't see how AI study assistants could get any better in the future, Deep Research is just that good. There's no point in waiting around!</p>\n<p>There's a little bit of a double edged sword here - AI makes learning easier, but it also commodifies a lot of traditional software developer knowledge and skills. I think the best approach is to focus on learning mental models around core technologies and avoid over-investing in things that don’t generalise well (e.g., obscure AWS services or LeetCode problems).</p>\n<p>There's still a lot of value in using Deep Research to just get the gist of things though! <a href=\"https://www.pluralsight.com/resources/blog/cloud/the-career-changing-art-of-reading-the-docs\">Knowing what's possible and being vaguely familiar</a> with the nooks and crannies of a core technology is useful.</p>\n<p>Hardly anyone does significant independent study in our field, but it pays off very fast. I've been solidifying my understanding of HTTP, JS exceptions and error handling, and containerisation over the past few weeks and I've benefited from it already. I alsouse it to research personal questions as well and the reports are always worth the read. This is one of my favourite software products ever.</p>","title":"Studying is 100 times easier than it used to be","short":"Some thoughts around the Deep Research tool","date":"2025-04-25","slug":"deep-research","createdAt":"2025-04-25","img":"blog-2.jpg","tags":["Note"]}},"__N_SSG":true}